---
type: LightType
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 16
tags: [revit-api, class]
---

# LightType

`Autodesk.Revit.DB.Lighting.LightType` · Revit 2024 · 16 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetInitialColor | 2013 | `public InitialColor GetInitialColor ()` |
| Method | GetInitialIntensity | 2013 | `public InitialIntensity GetInitialIntensity ()` |
| Method | GetLightDistribution | 2013 | `public LightDistribution GetLightDistribution ()` |
| Method | GetLightShape | 2013 | `public LightShape GetLightShape ()` |
| Method | GetLightType | 2013 | `public static LightType GetLightType ( Document document , ElementId typeId )` |
| Method | GetLightTypeFromInstance | 2013 | `public static LightType GetLightTypeFromInstance ( Document document , ElementId instanceId )` |
| Method | GetLossFactor | 2013 | `public LossFactor GetLossFactor ()` |
| Method | SetInitialColor | 2013 | `public void SetInitialColor ( InitialColor initialColor )` |
| Method | SetInitialIntensity | 2013 | `public void SetInitialIntensity ( InitialIntensity initialIntensity )` |
| Method | SetLightDistribution | 2013 | `public void SetLightDistribution ( LightDistribution lightDistribution )` |
| Method | SetLightShape | 2013 | `public void SetLightShape ( LightShape lightShape )` |
| Method | SetLossFactor | 2013 | `public void SetLossFactor ( LossFactor lossFactor )` |
| Property | ColorFilter | 2013 | `public Color ColorFilter { get ; set ; }` |
| Property | DimmingColor | 2013 | `public LightDimmingColor DimmingColor { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |